Repository: CatalinFrancu/varena2
Catalog: locale/*.utf8/LC_MESSAGES/messages.po
Languages: ro_ro

source: Problem not found.
ro_ro: Problema nu există.

source: %s file(s) uploaded successfully.
ro_ro: Am încărcat cu succes %s fișier(e).

source: There was a problem uploading «%s».
ro_ro: A apărut o eroare la încărcarea lui «%s».

source: Attachment not found or belongs to a different problem.
ro_ro: Fișierul atașat nu există sau aparține altei probleme.

source: %s attachment(s) deleted.
ro_ro: Am șters %s fișiere.

source: Permission denied to view this problem.
ro_ro: Nu ai permisiunea să vezi această problemă.

source: Source file uploaded successfully.
ro_ro: Am încărcat sursa cu succes.

source: Unknown extension «.%s».
ro_ro: Extensie necunoscută «.%s».

source: Round not found.
ro_ro: Runda nu există.

source: Round saved.
ro_ro: Am salvat runda.

source: This is only a preview. Don't forget to save your changes!
ro_ro: Aceasta este doar o previzualizare. Nu uita să salvezi modificările!

source: Tags saved.
ro_ro: Am salvat etichetele.

source: Role not found.
ro_ro: Rolul nu există.

source: Role deleted.
ro_ro: Am șters rolul.

source: Role saved.
ro_ro: Am salvat rolul.

source: User role deleted.
ro_ro: Rolul a fost șters.

source: User Role saved.
ro_ro: Rolul a fost salvat.

source: User not found.
ro_ro: Rolul nu există.

source: You cannot edit this problem.
ro_ro: Nu poți edita această problemă.

source: The problem name has changed. Remember to update any statement references (file names, attachments).
ro_ro: Numele problemei s-a schimbat. Nu uita să actualizezi orice referințe din enunț (nume de fișiere, fișiere atașate).

source: Problem saved.
ro_ro: Am salvat problema.

source: Source not found.
ro_ro: Sursa nu există.

source: Incorrect email or password.
ro_ro: Adresa de e-mail sau parola sunt incorecte.

source: You have entered an invalid or expired token.
ro_ro: Ai introdus un cod incorect sau expirat.

source: Please contact an administrator.
ro_ro: Te rugăm să contactezi un administrator.

source: Password changed.
ro_ro: Am schimbat parola.

source: The system is configured not to send out any emails. Please contact an administrator.
ro_ro: Sistemul este configurat să nu trimită emailuri. Te rugăm să contactezi un administrator.

source: Password change
ro_ro: Schimbarea parolei

source: We have sent an email to <b>%s</b>. Click on the included link to change your password.
ro_ro: Am trimit un mesaj către <b>%s</b>. Deschide linkul inclus pentru a-ți schimba parola.

source: Could not find your OpenID; did you really log in?
ro_ro: Nu ți-am putut găsi OpenID-ul; chiar te-ai conectat?

source: Changes saved.
ro_ro: Am salvat modificările.

source: evaluator queue
ro_ro: coada de evaluare

source: user
ro_ro: utilizator

source: problem
ro_ro: problemă

source: size
ro_ro: mărime

source: date
ro_ro: dată

source: status
ro_ro: stare

source: points
ro_ro: puncte

source: home
ro_ro: acasă

source: problems
ro_ro: probleme

source: rounds
ro_ro: runde

source: Romanian
ro_ro: Română

source: English
ro_ro: Engleză

source: my account
ro_ro: contul meu

source: logout
ro_ro: deconectare

source: login
ro_ro: conectare

source: admin tasks
ro_ro: acțiuni de administrator

source: edit roles
ro_ro: editează rolurile

source: edit tags
ro_ro: editează etichetele

source: source
ro_ro: sursă

source: score
ro_ro: scor

source: compiler
ro_ro: compilator

source: evaluation report
ro_ro: raport de evaluare

source: compilation report
ro_ro: raport de compilare

source: source code
ro_ro: cod-sursă

source: Score
ro_ro: Scor

source: CPU time (ms)
ro_ro: timp (ms)

source: memory used (KiB)
ro_ro: memorie folosită (KiB)

source: message
ro_ro: mesaj

source: group points
ro_ro: puncte pe grup

source: total score
ro_ro: scor total

source: Source status:
ro_ro: Starea sursei:

source: This source was not evaluated yet. Please try again later.
ro_ro: Această sursă nu a fost încă evaluată. Te rog să încerci mai târziu.

source: Compiler command
ro_ro: Comanda de compilare

source: Compiler output
ro_ro: Ieșirea compilatorului

source: edit role
ro_ro: editare rol

source: add a role
ro_ro: adaugă un rol

source: name
ro_ro: nume

source: save
ro_ro: salvează

source: cancel
ro_ro: anulează

source: delete
ro_ro: șterge

source: Users having this role
ro_ro: Utilizatori cu acest rol

source: User Roles
ro_ro: Roluri utilizatori

source: Users with roles:
ro_ro: Utilizatori care au roluri:

source: Assign a role to a user:
ro_ro: Atribuie un rol unui utilizator:

source: username
ro_ro: nume de utilizator

source: role
ro_ro: rol

source: roles
ro_ro: roluri

source: start date/time
ro_ro: data/ora de start

source: added by
ro_ro: adăugată de

source: duration
ro_ro: durată

source: minutes
ro_ro: minute

source: scoreboard
ro_ro: scoruri

source: rank
ro_ro: loc

source: No submissions yet.
ro_ro: Nu există surse trimise deocamdată.

source: edit
ro_ro: editează

source: tags
ro_ro: etichete

source: Click on any line for a menu. Don't forget to save your changes!
ro_ro: Click pe orice linie pentru un meniu. Nu uita să salvezi modificările!

source: the tag changes places with the previous sibling
ro_ro: eticheta schimbă locul cu fratele anterior

source: the tag changes places with the next sibling
ro_ro: eticheta schimbă locul cu fratele următor

source: the tag becomes its parent's next sibling
ro_ro: eticheta devine fratele următor al părintelui ei.

source: the tag becomes its previous sibling's child
ro_ro: eticheta devine fiu al fratelui ei anterior

source: add sibling
ro_ro: adaugă frate

source: add child
ro_ro: adaugă fiu

source: attachments
ro_ro: fișiere atașate

source: back
ro_ro: înapoi

source: uploader
ro_ro: autor

source: download
ro_ro: descarcă

source: Add attachments
ro_ro: Atașează fișiere

source: browse...
ro_ro: alege...

source: upload
ro_ro: încarcă

source: time limit
ro_ro: limită de timp

source: memory limit
ro_ro: limită de memorie

source: your score
ro_ro: scorul tău

source: author
ro_ro: autor

source: submitted sources
ro_ro: surse trimise

source: submit a source file
ro_ro: trimite o sursă

source: edit round
ro_ro: editare rundă

source: add a round
ro_ro: adaugă o rundă

source: description
ro_ro: descriere

source: round description (optional)
ro_ro: descrierea rundei (opțională)

source: start date/time (YYYY-MM-DD HH:MM)
ro_ro: data/ora de start (AAAA-LL-ZZ HH:MM)

source: duration (minutes)
ro_ro: durata (minute)

source: preview
ro_ro: previzualizează

source: Varena is working for you!
ro_ro: Varena funcționează!

source: edit problem
ro_ro: editare problemă

source: add a problem
ro_ro: adaugă o problemă

source: statement
ro_ro: enunț

source: parameters
ro_ro: parametri

source: problem name
ro_ro: numele problemei

source: generate a statement template based on the problems name
ro_ro: generează un șablon de enunț pe baza numelui problemei

source: generate template
ro_ro: generează șablon

source: problem statement
ro_ro: enunțul problemei

source: time limit (seconds)
ro_ro: limită de timp (secunde)

source: memory limit (kibibytes)
ro_ro: limită de memorie (kibibytes)

source: number of tests
ro_ro: numărul de teste

source: test grouping
ro_ro: gruparea testelor

source: e.g. 1-5; 6; 7; 8-10
ro_ro: de ex. 1-5; 6; 7; 8-10

source: grader
ro_ro: verificator (grader)

source: leave empty for diff evaluation
ro_ro: lasă gol pentru evaluare cu diff

source: public sources
ro_ro: surse publice

source: public tests
ro_ro: teste publice

source: feedback tests
ro_ro: teste feedback

source: e.g. 1,2,3,4
ro_ro: de ex 1,2,3,4

source: contest
ro_ro: concurs

source: year
ro_ro: an

source: grade
ro_ro: clasa

source: uses .ok files
ro_ro: folosește fișiere .ok

source: visibility
ro_ro: vizibilitate

source: Hi,
ro_ro: Salut,

source: You are receiving this message because you requested a password change. To change your password, please click this link within %d minutes:
ro_ro: Primești acest mesaj pentru că ai cerut schimbarea parolei. Pentru a-ți schimba parola, deschide acest link în maximum %d minute:

source: If you did not request this change, please discard this message.
ro_ro: Dacă nu ai cerut această schimbare, te rugăm să ignori acest mesaj.

source: Thank you,
ro_ro: Mulțumiri,

source: new password
ro_ro: parolă nouă

source: Choose a new password
ro_ro: Alege-ți o parolă nouă

source: password
ro_ro: parolă

source: password (again)
ro_ro: parolă (din nou)

source: change password
ro_ro: schimbă parola

source: Redirecting you to your OpenID provider...
ro_ro: Te redirectăm către furnizorul de OpenID...

source: choose a username
ro_ro: alege-ți un nume de utilizator

source: required; 3-20 characters including letters, digits, '-', '.' and '_'
ro_ro: obligatoriu; 3-20 caractere incluzând litere, cifre, '-', '.' și '_'

source: enter your full name
ro_ro: introdu numele tău complet

source: optional; 3-50 characters
ro_ro: opțional; 3-50 caractere

source: enter your email address
ro_ro: introdu adresa de e-mail

source: OpenID identities
ro_ro: Identități OpenID

source: link another OpenID to this account
ro_ro: leagă alt OpenID de acest cont

source: password change
ro_ro: schimbarea parolei

source: Type in your email and we'll send you an email to change your password.
ro_ro: Introdu adresa de e-mail și îți vom trimite un mesaj pentru a-ți schimba parola.

source: send
ro_ro: trimite

source: Know your password?
ro_ro: Îți știi parola?

source: Log in here.
ro_ro: Conectează-te aici.

source: Forgot password?
ro_ro: Ți-ai uitat parola?

source: Remember me
ro_ro: Ține-mă minte

source: Don't have an account?
ro_ro: Nu ai cont?

source: Sign up here.
ro_ro: Înregistrează-te aici.

source: Sign Up
ro_ro: Înregistrare

source: name (optional)
ro_ro: nume (opțional)

source: sign up
ro_ro: înregistrare

source: Already have an account?
ro_ro: Ai deja un cont?

source: Email login
ro_ro: Conectare prin e-mail

source: You can use this form to request a one-time token to login via email. This may be necessary in two cases:
ro_ro: Cu acest formular poți cere un cod de unică folosință cu care să te conectezi prin e-mail. Poți avea nevoie de aceasta în două cazuri:

source: Your OpenID provider is currently down;
ro_ro: Furnizorul tău de OpenID este momentan indisponibil;

source: Your account was migrated from another system and is not linked with any OpenID yet.
ro_ro: Contul tău a fost migrat de pe alt sistem și încă nu este legat de niciun OpenID.
